{
  "search-by-name": "Search by country or capital name...",
  "error": "An error occured, please try again later",
  "about-component": {
    "about": "About The Project - Capital Cities Quiz Game",
    "first": " The 'Capital Cities Quiz Game' is a dynamic and educational web-based project designed to challenge users' knowledge of global capital cities. Developed using a sophisticated technology stack, the application seamlessly integrates Angular for the front-end, Express.js and Node.js for the back-end, and PostgreSQL as the relational database management system.",
    "second": "The front-end, powered by Angular, delivers a visually appealing and responsive user interface, providing users with an immersive quiz experience. Users can seamlessly navigate through the quiz game, featuring randomly generated questions that test their knowledge of capital cities worldwide.",
    "third": "On the server side, Express.js, in conjunction with Node.js, forms a robust foundation for handling server-side logic, routing, and API creation. This combination ensures efficient communication between the user interface and the PostgreSQL database, contributing to a smooth and responsive overall experience. The back-end functionality encompasses user registration, secure login, and advanced features such as personalized user profiles for tracking quiz history and high scores. The inclusion of Express.js facilitates the creation of an interactive leaderboard, fostering healthy competition among users. Underlying the entire system is PostgreSQL, a powerful and scalable relational database management system. PostgreSQL efficiently manages data storage, retrieval, and manipulation, supporting essential features like user accounts, quiz history tracking, and leaderboard functionality."
  },
  "home-page": {
    "heading": {
      "first": "Knowledge is Power",
      "second": "Quiz Type Games",
      "third": "Capital Cities"
    },
    "content": {
      "first": "Quiz-type games, where individuals engage in friendly competition based on their knowledge, serve as highly valuable and engaging platforms in various contexts. These games not only offer an enjoyable and entertaining experience but also play a crucial role in fostering intellectual growth and cognitive skills. By challenging participants to answer diverse questions across different topics, quiz games stimulate critical thinking, memory retention, and problem-solving abilities. Furthermore, they provide an interactive and dynamic way for individuals to expand their knowledge base while promoting healthy competition. Whether used in educational settings to reinforce learning or as recreational activities, quiz games contribute to the development of a broad range of skills, including research skills, quick thinking, and adaptability. Moreover, the social aspect of competing with others enhances communication skills and teamwork. Overall, quiz-type games stand as effective tools for both education and entertainment, fostering a love for learning and creating an engaging environment that celebrates and rewards knowledge.",
      "second": "The Capital Cities game, which quizzes participants on matching countries with their respective capitals, offers a unique and beneficial way to enhance geographical knowledge. By challenging individuals to recall and associate countries with their capitals, the game not only promotes a deeper understanding of global geography but also strengthens memory retention and cognitive mapping skills. This type of quiz encourages players to broaden their cultural awareness and geopolitical understanding, fostering a sense of interconnectedness in the world. The game serves as an educational tool that transcends traditional learning methods, making the process of acquiring geographical knowledge more interactive and enjoyable. Additionally, the competitive nature of the game can motivate individuals to actively seek information about different countries and their capitals, contributing to a well-rounded and informed worldview. Overall, the Capital Cities game stands out as an effective and entertaining way to cultivate geographical literacy and a global perspective."
    }
  },
  "current-score": "Current score",
  "time-left": "Time left",
  "play-again": "Play again",
  "about": "About",
  "explore": "Explore",
  "profile": "Profile",
  "highscores": "Highscores",
  "feedback": "Feedback",
  "play": "Play",
  "play-now": "Play now",
  "login": "Login",
  "logout": "Logout",
  "num": "No",
  "country": "Country",
  "capital": "Capital",
  "region": "Region",
  "messages": {
    "enter-both-fields": "Enter both fields!",
    "enter-all-fields": "Enter all fields!",
    "passwords-dont-match": "Passwords do not match",
    "something-wrong": "Something went wrong."
  },
  "sentences": {
    "guess-the-capital": "Guess the capital"
  },
  "game-options": {
    "choose-settings": "Choose game settings:",
    "timer-options": "Timer options",
    "seconds": "seconds",
    "start-game": "Start game"
  },
  "regions": {
    "world": "World",
    "europe": "Europe",
    "asia": "Asia",
    "africa": "Africa",
    "australia": "Australia",
    "north-and-south-america": "North and South America",
    "oceania": "Oceania"
  },
  "login-component": {
    "username": "Username",
    "password": "Password",
    "dont-have-login": "Don't have an account?",
    "login": "Login",
    "register": "Register",
    "register-now": "Register",
    "already-have-login": "Already have an account?",
    "confirm-password": "Confirm Password"
  }
}
