{
  "about-component": {
    "about": "O Projektu - Kviz o Glavnim Gradovima",
    "first": "'Capital Cities Quiz Game' je dinamičan i edukativan web projekat osmišljen da izazove korisnike da testiraju svoje znanje o glavnim gradovima svijeta. Razvijen korišćenjem sofisticiranog tehnološkog staka, aplikacija integriše Angular za front-end, Express.js i Node.js za back-end, i PostgreSQL kao sistem za upravljanje relacionim bazama podataka.",
    "second": "Front-end, koji pokreće Angular, pruža vizuelno privlačan i responzivan korisnički interfejs, omogućavajući korisnicima da uživaju u kvizu. Korisnici mogu lako da se kreću kroz igru kviza, koja sadrži nasumično generisana pitanja za testiranje znanja o glavnim gradovima širom svijeta.",
    "third": "Na serverskoj strani, Express.js u kombinaciji sa Node.js formira čvrstu osnovu za obradu logike na strani servera, rutiranje i kreiranje API-ja. Ova kombinacija omogućava efikasnu komunikaciju između korisničkog interfejsa i PostgreSQL baze podataka, doprinoseći glatkom i responzivnom ukupnom iskustvu. Funkcionalnost back-enda obuhvata registraciju korisnika, siguran login, i napredne funkcije kao što su personalizovani korisnički profili za praćenje istorije kvizova i visokih rezultata. Uključivanje Express.js omogućava kreiranje interaktivne tabele sa najboljim rezultatima, podstičući zdravu konkurenciju među korisnicima. Osnovu cijelog sistema čini PostgreSQL, moćan i skalabilan sistem za upravljanje relacijonim bazama podataka. PostgreSQL efikasno upravlja skladištenjem, preuzimanjem i manipulacijom podataka, podržavajući ključne funkcije kao što su korisnički nalozi, praćenje istorije kvizova i funkcionalnost tabele sa najboljim rezultatima."
  },
  "home-page": {
    "heading": {
      "first": "Znanje je Moć",
      "second": "Kviz Igre",
      "third": "Glavni Gradovi"
    },
    "content": {
      "first": "Kviz igre, gdje se pojedinci takmiče na osnovu svog znanja, predstavljaju izuzetno vrijedne i zanimljive platforme u raznim kontekstima. Ove igre ne samo da nude prijatno i zabavno iskustvo, već igraju ključnu ulogu u podsticanju intelektualnog rasta i kognitivnih vještina. Izazivajući učesnike da odgovaraju na različita pitanja iz raznih oblasti, kviz igre podstiču kritičko razmišljanje, zadržavanje informacija i sposobnosti rješavanja problema. Pored toga, pružaju interaktivan i dinamičan način za širenje baze znanja, dok promovišu zdravu konkurenciju. Bilo da se koriste u obrazovnim okruženjima za učvršćivanje znanja ili kao rekreativne aktivnosti, kviz igre doprinose razvoju širokog spektra vještina, uključujući istraživačke vještine, brzo razmišljanje i prilagodljivost. Osim toga, društveni aspekt takmičenja sa drugima poboljšava komunikacijske vještine i timski rad. Sve u svemu, kviz igre su efikasni alati za obrazovanje i zabavu, podstičući ljubav prema učenju i stvarajući angažovano okruženje koje slavi i nagrađuje znanje.",
      "second": "Igra Glavni Gradovi, koja testira učesnike u povezivanju zemalja sa njihovim glavnim gradovima, nudi jedinstven i koristan način za unapređenje geografskog znanja. Izazivajući pojedince da se prisjete i povežu zemlje sa njihovim glavnim gradovima, igra ne samo da podstiče dublje razumijevanje globalne geografije, već i jača zadržavanje informacija i kognitivne mape. Ovaj tip kviza podstiče igrače da prošire svoju kulturnu svijest i geopolitičko razumijevanje, stvarajući osjećaj međusobne povezanosti u svijetu. Igra služi kao obrazovni alat koji nadilazi tradicionalne metode učenja, čineći proces sticanja geografskog znanja interaktivnijim i prijatnijim. Pored toga, takmičarski karakter igre može motivisati pojedince da aktivno traže informacije o različitim zemljama i njihovim glavnim gradovima, doprinoseći sveobuhvatnom i informisanom pogledu na svijet. Sve u svemu, igra Glavni Gradovi se izdvaja kao efikasan i zabavan način za razvijanje geografske pismenosti i globalne perspektive."
    }
  },
  "current-score": "Trenutni rezultat",
  "time-left": "Preostalo vrijeme :",
  "play-again": "Ponovi igru",
  "about": "Informacije",
  "explore": "Istraži",
  "profile": "Profil",
  "highscores": "Najbolji rezultati",
  "feedback": "Povratne informacije",
  "play": "Igraj",
  "play-now": "Igraj sada",
  "login": "Prijavi se",
  "logout": "Odjavi se",
  "num": "Br",
  "country": "Država",
  "capital": "Grad",
  "region": "Regija:",
  "messages": {
    "enter-both-fields": "Unesi vrijednosti u oba polja!",
    "enter-all-fields": "Unesi vrijednost za sva polja!",
    "passwords-dont-match": "Lozinke se ne poklapaju",
    "something-wrong": "Došlo je do greške."
  },
  "sentences": {
    "guess-the-capital": "Pogodi glavni grad"
  },
  "game-options": {
    "choose-settings": "Izaberi opcije:",
    "timer-options": "Trajanje partije:",
    "seconds": "sekundi",
    "start-game": "Započni igru"
  },
  "regions": {
    "world": "Svijet",
    "europe": "Evropa",
    "asia": "Azija",
    "africa": "Afrika",
    "australia": "Australija",
    "north-and-south-america": "Sjeverna i Južna Amerika",
    "oceania": "Okeanija"
  },
  "login-component": {
    "username": "Korisničko ime",
    "password": "Lozinka",
    "dont-have-login": "Nemaš nalog?",
    "login": "Prijavi se",
    "register": "Registracija",
    "register-now": "Registruj se",
    "already-have-login": "Već imaš korisnički nalog?",
    "confirm-password": "Potvrdi lozinku"
  }
}
